package com.example.gas_test_as_0001;

import java.util.ArrayList;

public class Contain_Data {
// Теория
    public ArrayList<String> _10_important() {
        ArrayList<String> _10_important = new ArrayList<>();
        _10_important.add("Первое, что нужно сделать, " +
                "чтобы стать успешным и богатым человеком – " +
                "научить себя дисциплине. Жесткому, " +
                "безоговорочному подчинению своей воле собственных слабостей. " +
                "Человек, который не в состоянии контролировать себя, " +
                "не сможет выполнить даже малое задание, не говоря уже о купном проекте.");
        _10_important.add("решить, в какой сфере нужно действовать. " +
                "Выбрать свое направление – то, " +
                "что будет доставлять удовольствие мне лично, " +
                "принесет пользу другим людям. Если этим кто-то уже занимается, " +
                "стоит подумать как превзойти соперника " +
                "(возможно, предложив дополнительные услуги или более качественные выполнение работы).");
        _10_important.add("постоянно развиваться, обучаться, быть в числе первых, " +
                "обладающих уникальными знаниями. Ведь всем давно известно, " +
                "кто владеет информацией, тот владеет миром. Только тот, " +
                "кто более образован, подкован, сведущ в специфических вопросах своего бизнеса, " +
                "станет самым успешным среди конкурентов.");
        _10_important.add("должна быть неутомимая вера в себя, " +
                "в успех предприятия. Несмотря на насмешки окружающих, " +
                "неудачи, потери, нужно терпеливо двигаться в направлении поставленной цели. " +
                "Все мультимиллионеры, находясь в шаге от величайшего успеха, терпели насмешки и лишения. " +
                "От неудачников их отличает только одно – они не бросили начатое, " +
                "а продолжали упорно двигаться вперед.");
        _10_important.add("научиться экономить на всем. " +
                "Мне понравился пример Бодо Шефера, который не менял замок на двери авто(!), " +
                "только потому, что этой траты не предусматривалось по плану. " +
                "Не смотря на неудобства, Шефер отказал себе в, казалось бы, необходимом ремонте. " +
                "Экономия – не скупость, как может показаться на первый взгляд. " +
                "Это есть тотальный контроль за всеми своими расходами. " +
                "Кто умеет считать копейки, сможет сосчитать миллионы.");
        _10_important.add("изучить науку инвестирования, приумножения капитала. " +
                "Ведь «кто работает весь день, тому некогда зарабатывать деньги». " +
                "Управляя рисками, непременно следует контролировать рост сбережений.");
        _10_important.add("практически все богатые люди заявляют, " +
                "что богатство не будет расти, если им не поделиться с ближними. " +
                "Регулярные пожертвования приносят радость нуждающимся и тому, кто дарит. Все счастливы.");
        _10_important.add("планировать каждый свой день и час, следовать графику в точности. " +
                "Стремиться выполнить работу не на 100%, а на все 300%.");
        _10_important.add("нужно быть высокодуховным человеком, любить себя, окружающих. " +
                "Соблюдать законы справедливости и добропорядочности.");
        _10_important.add("уметь радоваться, отдыхать. Заботиться о своем здоровье. " +
                "Дарить любовь своей семье. Без личного счастья успех маловероятен.");
        return _10_important;
    }
    public ArrayList<String> habit_rich() {
        ArrayList<String> habit_rich = new ArrayList<>();
        habit_rich.add("Богатые и успешные люди всегда имеют план: на жизнь, на год, на сегодня.");
        habit_rich.add("Богатые всегда помнят про свою цель и неукоснительно следуют за ней.");
        habit_rich.add("Богачи редко тратят время на бесполезные развлечения. " +
                "Они не смотрят телевизор, а если читают, то не беллетристику, " +
                "а ту литературу, которая помогает им стать еще более развитыми, " +
                "заработать миллионы и стать миллионерами.");
        habit_rich.add("Богатые не смотрят телевизор.");
        habit_rich.add("Богатые полностью отдаются работе, выкладываясь на 100%, даже если кажется, " +
                "что успех уже достигнут.");
        habit_rich.add("Успешные люди окружают себя единомышленниками – позитивными и удачливыми бизнесменами, " +
                "представителями независимых и творческих профессий.");
        habit_rich.add("Богатые следят за своим здоровьем: здоровье – это силы, силы – это возможности к успеху.");
        habit_rich.add("Богатые надеются не на удачу, а на себя. Не надеются на халяву, " +
                "а только и исключительно на свои силы.");
        habit_rich.add("Состоятельные люди способны полностью отдаваться работе.");
        habit_rich.add("Богатые следят за своим здоровьем и питанием: им важно, " +
                "как они выглядят и чувствуют себя.");
        habit_rich.add("Состоятельные граждане больше верят в собственные силы, " +
                "чем в абстрактную удачу: по этой причине богачи редко играют в лотерею.");
        return habit_rich;
    }
    public ArrayList<String> advice_Success() {
        ArrayList<String> advice_Success = new ArrayList<>();
        advice_Success.add("Нужно работать на себя, а не на руководителя, " +
                "который всегда получает много денег, а трудящимся часто недоплачивает. " +
                "Наличие даже маленького собственного бизнеса – важное достижение на пути к успеху.");
        advice_Success.add("Использовать чувство зависти во благо: как импульс для продвижения вперед.");
        advice_Success.add("Надо не избегать проблем, а решать их. " +
                "Поставив перед собой, цель разбогатеть, человек должен быть готов работать над массой задач.");
        advice_Success.add("Успешные бизнесмены должны уметь идти на оправданный и заранее просчитанный риск.");
        advice_Success.add("Меньше мечтать, откладывая все планы на потом и больше делать, " +
                "не дожидаясь подходящей возможности.");
        advice_Success.add("Не стоит упускать альтернативные способы заработка, " +
                "даже если уже есть постоянный источник прибыли. Это позволит человеку двигаться вперед.");
        advice_Success.add("Следует понять, то быстро разбогатеть не получится. " +
                "Необходимо приложить много усилий и времени. Бизнес формируется на протяжении многих лет.");
        advice_Success.add("В достижении богатства, вам также поможет правильно составленный личный финансовый план.");
        return advice_Success;
    }
    public ArrayList<String> advice_John() {
        ArrayList<String> advice_John = new ArrayList<>();
        advice_John.add("Шутить и занимать деньги нужно внезапно.");
        advice_John.add("Умение обращаться с людьми – это товар, который можно купить точно так же, " +
                "как мы покупаем сахар или кофе. И я заплачу за такое умение больше, " +
                "чем за что-либо другое на свете.");
        advice_John.add("Ваше благополучие зависит от ваших собственных решений.");
        advice_John.add("Я всегда пытался превратить каждую неудачу в возможность.");
        advice_John.add("Я скорее найму человека с энтузиазмом, чем того, который все знает.");
        advice_John.add("Человек, переспевающий в жизни, должно иногда идти против течения.");
        advice_John.add("Способ делать деньги состоит в том, чтобы покупать, когда на улицах льется кровь.");
        advice_John.add("Я никогда не догадывался, кем окажусь в этой жизни, но я всегда знал, " +
                "что рожден для чего-то большего.");
        advice_John.add("Благодаря упорству, все что угодно, - будь то правильное или нет, " +
                "хорошее или плохое – будет достигнуть.");
        advice_John.add("Недостаточно просто поступать правильно, " +
                "самое главное – это позволять людям знать, что вы поступаете правильно.");
        return advice_John;
    }
    public ArrayList<String> _11_secrets() {
        ArrayList<String> _11_secrets = new ArrayList<>();
        _11_secrets.add("ЖЕЛАНИЕ! Мало ли чего вы хотите в жизни, вы должны желать этого, " +
                "чтобы получить шанс достичь. Причина, почему большинство людей неудачники по жизни, " +
                "заключается в том, что они не имеют достаточно ОГНЯ ЖЕЛАНИЯ для достижения своих амбиций.");
        _11_secrets.add("ЦЕЛИ! Каковы бы ни были ваши амбиции, вы не сможете достичь успеха пока не имеете ЦЕЛЕЙ.");
        _11_secrets.add("ЭНЕРГИЯ! Недостаточно иметь желания и цели. " +
                "У вас должно быть также необходимое количество. Ментальной и Психической энергии.");
        _11_secrets.add("ПЛАН ДЕЙСТВИЙ! Все миллионеры и успешные люди, " +
                "которых мы знаем, имеют план действий, которому они следуют.");
        _11_secrets.add("ТВОРЧЕСТВО! Творчество – это способность разрабатывать новые и " +
                "лучшие способы делать что-либо. Чтобы быть творческим вы должны обладать воображением, " +
                "предприимчивость, бесстрашием и дерзостью.");
        _11_secrets.add("РИСКУЙТЕ!");
        _11_secrets.add("ИСПОЛЬЗУЙТЕ ДЕНЬГИ ДРУГИХ ЛЮДЕЙ! " +
                "Правда в том, что для создания богатства, вам нужны деньги. " +
                "Но деньги не должны быть вашими» " +
                "Богатые люди имеют привычку использовать деньги других людей для создания богатства.");
        _11_secrets.add("УСИЛИЕ! Усилие – еще один мощный инструмент, используемый каждым богатым человеком. " +
                "Один из величайших миллионеров Америки Джон Пол Гетти говорил: " +
                "«Я лучше использую 1% усилий ста человек, чем 100% моих собственных усилий». " +
                "Усилие – это золотой ключ для быстрого обогащения.");
        _11_secrets.add("УПОРСТВО! Одно из самых сильных качество богатых и знаменитых людей это то, " +
                "что они НИКОГДА не сдаются. Они очень упорны.");
        _11_secrets.add("САМОДИСЦИПЛИНА! Миллионеры и успешные бизнесмены – это люди с огромной самодисциплиной. " +
                "Вы должны уметь управлять собой. Сюда относиться что вы едите и пьете, сколько спите, " +
                "сколько денег тратите, о чем думаете и во что верите, что говорите другим людям.");
        _11_secrets.add("ВРАЩАЙТЕСЬ В ПРАВЛИЬНО КОМПАНИИ! " +
                "Самый лёгкий способ изучить секреты богатых и знаменитых людей – " +
                "это вращаться среди них и общаться с ними. Изучайте разговоры походку и " +
                "действуйте как они. Ходите на их вечеринки, учувствуйте в тех же мероприятиях, и " +
                "отдыхайте там же где они. Общаясь с богатыми и знаменитыми, вы получите ценную информацию и " +
                "удачные возможности. Читайте истории успеха известных людей, мотайте «на ус» их цитаты.");
        return _11_secrets;
    }
    public ArrayList<String> way_earn() {
        ArrayList<String> way_earn = new ArrayList<>();
        way_earn.add("Следует разделить способы зарабатывания денег на две категории: " +
                "честные и нечестные. Вторую категорию следует отбросить сразу: " +
                "рано или поздно такой способ заработка вам аукнется в том или ином виде.");
        way_earn.add("Существует два честных способа заработка? " +
                "Работа по найму и работа на себя. " +
                "Как третий промежуточный вариант можно рассмотреть совмещение этих способов " +
                "в той или иной пропорции.");
        way_earn.add("Самый эффективный – но и самый трудоемкий! – способ заработка, " +
                "это, разумеется, работа на себя. " +
                "Это требует огромных усилий и ответственности, который не каждый решится на себя взять.");
        way_earn.add("Если вы не готовы работать всецело на себя, " +
                "рассмотрите возможность стороннего заработка помимо основной работы, возможно, " +
                "позже это станет вашим делом жизни.");
        way_earn.add("Если у вас есть хобби или любимое занятие, " +
                "постарайтесь сделать это делом своей жизни. " +
                "Возможно, вы не сразу придумаете как монетизировать свое увлечение, " +
                "но при желании, вы найдете решение.");
        return way_earn;
    }
    public ArrayList<String> _10_ways() {
        ArrayList<String> _10_ways = new ArrayList<>();
        _10_ways.add("Выйти замуж (жениться) на богатом человеке. " +
                "При этом обязательно нужно оформить брачный контракт.");
        _10_ways.add("Путем мошенничества, что подразумевает сотрудничество с нечестными людьми. " +
                "При совершении ошибки, добросовестного бизнесмена всегда поймут и дадут шанс, " +
                "а плут будет наказан правоохранительными органами или другими мошенниками. ");
        _10_ways.add("Люди могут разбогатеть за счет совей жадности. " +
                "Это самая презираемая категория среди успешных бизнесменов, " +
                "поскольку человек часто обманывает других, поэтому никогда не может стать лидером.");
        _10_ways.add("Крайняя экономия на всем - один из 10 способов как стать богаче. " +
                "Так стараются обрести финансовую независимость люди, " +
                "предпочитающие жить на малую часть за имеющихся денег вместо того, " +
                "чтобы искать дополнительные источники дохода.");
        _10_ways.add("Упорный труд. Человек тратит массу усилий и времени, но ему нужно платить много налогов.");
        _10_ways.add("За счет привлекательности, таланта, исключительного ума.");
        _10_ways.add("Случайная удача: выигрыш в лотерее, скачках и других подобных мероприятиях. " +
                "Однако это случается редко, но люди все равно готовы тратить очень много средств.");
        _10_ways.add("Получить деньги по наследству – еще один из 10 способов как стать богаче.");
        _10_ways.add("Инвестирование – то, к чему нужно стремиться по мнению Роберта Киасаки.");
        _10_ways.add("Создание собственного бизнеса. Успешными в этом способе стали " +
                "Билл Гейтс (создатель Microsoft), Майкл Делл (основатель компании Dell).");
        return _10_ways;
    }
    public ArrayList<String> _10_ideas() {
        ArrayList<String> _10_ideas = new ArrayList<>();
        _10_ideas.add("Мишель Ферреро и семья. Европа. $10 млрд. Замысел: изготовление " +
                "шоколадного масла для бутербродов и тостов на завтрак, включить шоколад в ежедневное меню.");
        _10_ideas.add("Брэд Хьюз. $5.3 млрд. Замысел: " +
                "для удобства всех желающих установить вдоль автострад автоматические камеры хранения.");
        _10_ideas.add("Ральф Лоурен. $5 млрд. Замысел: наклеить на обычную рубашку-поло яркий ярлык " +
                "с изображением лошади. Назвать цену 50 долларов и в дальнейшем подсчитывать свою прибыль.");
        _10_ideas.add("Джефф Безос. $4.4 млрд. Замысел: освободить покупателей книг " +
                "от длительных походов по книжным магазинам и в поиске нужной им литературы. " +
                "Продавать книги через интернет.");
        _10_ideas.add("Тай Уорнер. $4.5 млрд. Замысел: " +
                "выпуск для продажи ограниченных партий милых, плющевых медведей с теплыми, " +
                "трогательными именами. Эти игрушки после продажи сразу становятся коллекционными экземплярами.");
        _10_ideas.add("Калео Ювидиха, Таиланд. Дитрих Матешиц, Австрия. $3.1 млрд., " +
                "$3.1 млрд. (соответственно). Замысел: спортсменам и любителям ночных вечеринок " +
                "продавать энергетический напиток на основе сахара и кофеина, который богат на витамин В.");
        _10_ideas.add("Марио Моретти Полигато. Италия. $3 млрд. Замысел: производство обуви, " +
                "которая предназначена для людей, страдающих от запаха пота на ногах. " +
                "Специальные стельки с маленькими дырочками в подошве помогают избежать неприятного запаха.");
        _10_ideas.add("Джеймс Дайсон. Великобритания. $1.6 млрд. Замысел: создание мощного пылесоса, " +
                "который способен всасывать пыль со скоростью от 320 км/час и выше. " +
                "Такая скорость позволяет упаковывать пыль плотно и сделает невозможными ее выброс наружу.");
        _10_ideas.add("Ханс и Поль Райгели, ФРГ. $1.5 млрд. (у каждого). " +
                "Замысел: продажа сладких жевательных конфет разнообразных форм.");
        _10_ideas.add("Говард Шульц. $1.1 млрд. " +
                "Замысел: каждый угол дома в Америке должен иметь свой кофейный магазинчик.");
        return _10_ideas;
    }
    public ArrayList<String> money_primets() {
        ArrayList<String> money_primets = new ArrayList<>();
        money_primets.add("Деньги любят счет.");
        money_primets.add("Считать деньги стоит в одиночестве в закрытом помещении.");
        money_primets.add("Кошелек должен быть дорогим, чтобы деньги в нем водились.");
        money_primets.add("В кошельке стоит носить крупную денежную купюру и ее не тратить, " +
                "чтобы чувствовать себя уверенней");
        money_primets.add("Чем больше сумма, тем больше становится у человека желаний.");
        money_primets.add("Деньги притягивают к себе деньги.");
        money_primets.add("При возврате денег говорите: «чтобы у тебя всегда были и у меня приумножились».");
        money_primets.add("Будьте щедры на чаевые за хорошо проделанную работу.");
        money_primets.add("Чем выше доходы, тем выше расходы.");
        money_primets.add("Получайте деньги с удовольствием, и расставайтесь с деньгами без сожалений.");
        money_primets.add("Деньги всего лишь деньги.");
        money_primets.add("Деньги — это не цель, это средство.");
        money_primets.add("Всегда просите скидку.");
        money_primets.add("Не гонитесь за дешевизной, лучше переплатить, чем не доплатить.");
        money_primets.add("Не присваивайте чужих денег. Свои деньги лучше любых чужих.");
        money_primets.add("Называйте свою прибыль «ДОХОД».");
        money_primets.add("Откладывайте деньги только с прибыли.");
        return money_primets;
    }
    public ArrayList<String> how_become_rich() {
        ArrayList<String> how_become_rich = new ArrayList<>();
        how_become_rich.add("Составляйте планы: вы должны видеть перспективу своего развития – " +
                "так вам будет легче идти к поставленной цели. Кроме того, " +
                "планирование позволит вам распределить свое время максимально эффективно.");
        how_become_rich.add("Ставьте свои интересы на первый план, " +
                "и не ставьте интересы вашего работодателя выше своих.");
        how_become_rich.add("Мыслите в позитивном ключе и поддерживайте гармонию в душе. " +
                "Хорошее настроение – залог успеха.");
        how_become_rich.add("Научитесь грамотно распоряжаться имеющимися деньгами. " +
                "Научитесь не тратить лишнего, не брать в долг, " +
                "откладывать деньги на развитие и инвестирование в себя.");
        return how_become_rich;
    }
// Практические советы
    public ArrayList<String> laws_success() {
        ArrayList<String> laws_success = new ArrayList<>();
        laws_success.add("Чтобы победить, нужно не бояться проиграть. " +
                "Многие люди не одерживают финансовых побед, потому что боль от потери денег, " +
                "гораздо сильнее радости, которое доставляет богатство.");
        laws_success.add("Пессимизм порождается сомнениями и неконтролируемым страхом. " +
                "Пессимисты критикуют, а победители анализируют. " +
                "Анализ позволяет увидеть близорукость критиков и заметить возможности, " +
                "упущенные из виду остальными.");
        laws_success.add("Слова «Я не могу себе позволить» лишают человека возможности думать. " +
                "А вопрос №Как я смогу себе это позволить?» заставляет мозг думать и искать ответы.");
        laws_success.add("Бедные платят всем остальным, и только потом себе – если у них что-то остается. " +
                "Богатые платят первым делом себе, даже если не хватает денег. " +
                "Это заставляет искать новые способы получения дохода.");
        laws_success.add("Найдите причину, которая сильнее реальности: сила духа. " +
                "Однажды я познакомился с девушкой, которая мечтала выступать за олимпийскую сборную по плаванию. " +
                "Ей приходилось каждое утро вставать в четыре утра, " +
                "чтобы провести трёхчасовую тренировку и успеть в колледж. " +
                "Она не ходила с друзьями на вечеринки по субботам и выходные посвящала учебе, " +
                "чтобы не отстать по успеваемость. " +
                "Когда я спросил, чем вызвано это сверхчеловеческое трудолюбие и самопожертвование, " +
                "она ответила: «Я делаю это для себя и для тех, кого люблю. " +
                "Любовь заставляет меня преодолевать трудности и приносить эти жертвы».");
        laws_success.add("Ежедневно делайте выбор: сила выбора. Большинство людей не хотят быть богатыми. " +
                "Этот выбор объясняется тем, что для 90% населения быть богатым слишком хлопотно. " +
                "Поэтому они изобретают всяческие оправдания: «Деньги меня не интересуют» " +
                "Я все равно никогда не стану богатым» и т.д. " +
                "Эти заявления лишают человека двух вещей: времени, которое является его самым ценным активом, " +
                "и возможности учиться. Но жизнь устроена так, что всем нам каждый день приходиться выбирать: " +
                "мы выбираем как распорядиться своим временем, " +
                "что сделать со своими деньгами какими мыслями занять свою голову. " +
                "Вот в чем заключается сила выбора. Выбор есть у всех. " +
                "Я выбираю богатство и делаю этот выбор каждый день.");
        laws_success.add("Не прислушивайтесь к мнению бедных или напуганных людей.");
        laws_success.add("Учите, и дано будет вам: сила дающего. Чем больше я учу тех, " +
                "кто хочет учиться, тем больше узнаю сам. Если вы хотите что-то узнать о деньгах, " +
                "научитесь тому, что вы уже знаете, кото-то другого. " +
                "К вам придет целый поток новых идей и более глубокое понимание предмета.");
        laws_success.add("Специализация имеет и преимущества, и недостатки. " +
                "У меня есть совершенно гениальные друзья, " +
                "которые не умеют эффективно общаться с другими людьми поэтому " +
                "у них совершенно мизерные заработки. Я советую им потратить всего лишь год на то, " +
                "чтоб бы научиться продавать. Даже если за это время они ничего не заработают, " +
                "они значительно улучшат свои коммуникационные навыки. Результат окажется поистине бесценным.");
        laws_success.add("Записывайтесь на курсы, читайте литературу и посещайте семинары. " +
                "В интернете я постоянно ищу объявления о новых и интересных курсах, " +
                "многие из которых проводятся бесплатно или стоят очень дешево. Кроме того, " +
                "я посещаю дорогие семинары. Благодаря знаниям, полученным на курсах, " +
                "я богат и мне не нужно работать. У меня есть друзья, " +
                "которые игнорировали эти курсы и говорили мне, что я впустую трачу деньги. " +
                "Они до сих пор работают по прежних местах.");
        return laws_success;
    }
    public ArrayList<String> can_i_make() {
        ArrayList<String> can_i_make = new ArrayList<>();
        can_i_make.add("Определите сферы, которыми вам было бы интересно заниматься в жизни, " +
                "подумайте, как можно извлечь выгоду из любимого вами занятия.");
        can_i_make.add("Собирайте информацию, у кого информация, тот всемогущ.");
        can_i_make.add("Продумайте финансовый план: как личный, так и касающийся дела вашей жизни.");
        can_i_make.add("Заведите дневник, в котором будете записывать все возникающие идеи " +
                "(даже, на первый взгляд, кажущиеся глупыми), мысли и планы.");
        can_i_make.add("Проявляйте решительность: если вы считаете, что какое-то дело может получиться, " +
                "не откладывайте его, начните реализовывать его уже сейчас.");
        can_i_make.add("Помните, что главные враги финансовой свободы – лень и нерешительность.");
        return can_i_make;
    }
    public ArrayList<String> how_create_ideas() {
        ArrayList<String> how_create_ideas = new ArrayList<>();
        how_create_ideas.add("Мечтайте о миллионе. Не думайте о рублях. Мечтайте о миллионах. " +
                "Большие задачи позволяет найти большие мысли.");
        how_create_ideas.add("Тренируйте мозг. Задавание вопросов лучший тренинг для мозга. " +
                "Почему? Зачем? КАК? Кто? Когда? Чем больше подобных вопросов вы зададите себе, " +
                "тем яснее станет картина, тем проще будет ухватить идею за хвост.");
        how_create_ideas.add("Мозговой штурм. Просто гениальное изобретение. Согласитесь, " +
                "что количество ответов на вопрос как создать идею, " +
                "будет совершенно разным если спросить у одного или десяти человек. Обсуждайте, " +
                "делитесь мыслями с окружающими и получайте обратную связь.");
        how_create_ideas.add("Слушайте. Подмечайте все что услышите, ловите идеи других. " +
                "Иногда разговор, который не имеет отношения к вашей области может натолкнуть " +
                "на гениальную мысль. Помните фильм «Социальная сеть», как Цукерберг придумал Facebook?");
        how_create_ideas.add("Проявляйте терпение. Если идеи долго не появляются, " +
                "расслабьтесь и ждите свое «яблоко Ньютона»");
        how_create_ideas.add("Учитесь. Идеи редко приходят к человеку, " +
                "который ничего не знает в данной области. Читайте блоги, книги, " +
                "смотрите фильмы – анализируйте, конспектируйте и думайте.");
        how_create_ideas.add("Переключайтесь. Нельзя постоянно думать об одном и том же, рано или поздно это надоест. " +
                "Занимайтесь спортом, гуляйте, играйте с детьми и идеи придут незаметно.");
        how_create_ideas.add("Общение. Чем больше разных людей в круге вашего общения, тем лучше. " +
                "Каждый человек имеет свой набор навыков, взглядов и идей. " +
                "Общение с людьми из разных сфер позволит узнать много нового, " +
                "и вдруг получить зацепку для решения своих проблем.");
        how_create_ideas.add("Подготовка залог успеха. Прежде чем ждать идей хорошенько подготовьтесь. " +
                "Проведите анализ и выясните, каких знаний вам не хватает, идите и получите эти знания.");
        how_create_ideas.add("Записывайте. Грош цена будет мысли, которая пришла в голову, " +
                "и вы забыли ее. Носите с собой блокнот, используйте диктофон, нацарапайте на стене, " +
                "но сохраните ее для себя любой ценой.");
        return how_create_ideas;
    }
    public ArrayList<String> where_to_begin() {
        ArrayList<String> where_to_begin = new ArrayList<>();
        where_to_begin.add("Учитесь мечтать! Мечты – это ваш козырь Определите чего вы хотите " +
                "в жизни и превратите ваши мечты в цели.");
        where_to_begin.add("Ответьте себе честно на вопросы «кто я? В чем мой смысл жизни?».");
        where_to_begin.add("Возьмите на себя ответственность за свою жизнь: ваш уровень жизни зависит " +
                "от вас и только от вас.");
        where_to_begin.add("Возьмите за правило решать все возникающие проблемы по мере их появления. " +
                "Не откладывайте дела на завтра!");
        where_to_begin.add("Заведите привычку записывать все свои достижения – маленькие и большие – в дневник успехов. " +
                "В моменты упадка сил перечитывайте этот дневник и заряжайтесь энергией и верой в себя.");
        where_to_begin.add("Старайтесь общаться в успешными, позитивно мыслящими людьми. По возможности избегайте контакта " +
                "с «диванными мечтателями». неудачниками и пессимистами: они тянут вас на дно»");
        where_to_begin.add("Если на данном этапе жизни вам сложно сменить свое окружение, как написано " +
                "в предыдущем совете, возьмите за правило регулярно читать истории успеха людей, " +
                "добившихся финансовых высот.");
        where_to_begin.add("Не отказывайтесь от возможностей, которые вас посылает жизнь. " +
                "Почаще говорите «да!» и не бойтесь рисковать.");
        where_to_begin.add("Все время постоянно учитесь и самосовершенствуйтесь. " +
                "Только это даст вам возможность быть конкурентоспособным и вырваться вперед.");
        return where_to_begin;
    }
    public ArrayList<String> way_finances_manage() {
        ArrayList<String> way_finances_manage = new ArrayList<>();
        way_finances_manage.add("Ваши расходы должны быть меньше доходов. Научитесь тратить МЕНЬШЕ, " +
                "чем вы зарабатываете. Забудьте про понятия «долг» и «кредит».");
        way_finances_manage.add("Возьмите за правило откладывать 10% ваших доходов. Делайте это сразу, " +
                "и запретите себе трогать эти накопления. Вы сможете накопить на что-то, " +
                "о чем мечтали, и будете себя чувствовать в безопасности, ведь у вас есть «финансовая подушка».");
        way_finances_manage.add("Покупайте только то, на что у вас действительно хватает денег. " +
                "Глупо, например, покупать телефон ценой в вашу зарплату: " +
                "привычка не соизмерять свои желания расходы не приведет вас успеху.");
        way_finances_manage.add("Ведите ваш личный и семейный бюджет. " +
                "Это может быть табличка в компьютере или специальное приложение на телефоне, " +
                "главное, отмечайте все свои, даже самые минимальные траты.");
        way_finances_manage.add("Не обращаете внимание на то, как другие тратят свои деньги. " +
                "И научитесь не считать чужие деньги.");
        way_finances_manage.add("Регулярно анализируйте свои финансы (может быть, вы тратите большую сумму впустую?), " +
                "и карьерные возможности.");
        way_finances_manage.add("Увидели что-то недорогое и сразу захотели приобрести? " +
                "Держите эту мысль в голове 10 секунд и честно задайте себе вопрос: правда ли эта вещь нужна вам?");
        way_finances_manage.add("Приучите себя выжидать 30 дней до совершения большой покупки, вполне возможно, " +
                "что за это время вы поймете, что эта вещь вам не так уж и нужна, и сэкономите деньги.");
        way_finances_manage.add("Ходите за продуктами только со списком покупок, так вы не потратите лишнего.");
        return way_finances_manage;
    }
    public ArrayList<String> rich_principle() {
        ArrayList<String> rich_principle = new ArrayList<>();
        rich_principle.add("откладывай по 25% дохода и 50% от сверх дохода на отдельный счет! " +
                "Впоследствии инвестируй эти деньги. Банки платят копейки и спасают только деньги от инфляции!");
        rich_principle.add("Экономь! Только экономя и вкладывая деньги, можно стать миллионером " +
                "за несколько лет. Расточительный образ жизни редко ведет к росту благосостояния в начале пути.");
        rich_principle.add("Наша беда — мы плохо относимся к нашим деньгам. Полюбите деньги! " +
                "Не в плане как потратить, а берегите их. Притом, никто не говорит, что нужно отказываться " +
                "от довольствий!");
        rich_principle.add("Создайте свой финансовый план на 7 — 10 лет. Определитесь к чему " +
                "Вы стремитесь и сколько хотите зарабатывать через год, два и т.п. " +
                "Определитесь что Вы будете делать для этого.");
        rich_principle.add("Мечты не должны быть мелкими! Мыслите глобально! " +
                "Мечтайте о миллиардах и о большом успехе (в карьере, политике и т.п.) " +
                "Большие мечты делите на небольшие цели. " +
                "Последовательно добивайтесь локальных (небольших целей), ведущих к большой мечте.");
        rich_principle.add("Ваши принципы мышления должны быть как у миллиардера или миллионера. " +
                "Старайтесь мылить категориями богатых людей!");
        rich_principle.add("Будьте уверены в себе. Вырабатывайте эти принципы. Деньги и люди " +
                "тянутся к уверенным в себе людям! Будьте уверенны в своем успехе даже тогда, " +
                "когда дела идут плохо!");
        rich_principle.add("Не бойтесь проблем!!! Научитесь радоваться проблемам и неудачам. " +
                "Большие цели рождают часто большие проблемы и трудности. Решая проблемы, мы становимся сильнее!");
        rich_principle.add("Упавший, поднявшись — становится сильнее, (внимательно вчитайтесь в эту фразу и подумайте). " +
                "Очень актуальная правило для тех кого коснулся кризис.");
        rich_principle.add("Финансовое благополучие невозможно, без финансовых ограничений и " +
                "планирования своих трат. Финансовая свобода идет через финансовые ограничения!");
        rich_principle.add("Удача танцует лишь с теми, кто приглашает ее на танец!");
        rich_principle.add("Если Вы решили что-то сделать, но не начали это делать " +
                "в течении 72 часов — в 85% случаев Вы не сделаете это никогда!");
        rich_principle.add("Верите ли Вы что разбогатеете? Не важно верите или нет, " +
                "но если будете соблюдать простейшие правила и принципы управления личными финансами " +
                "Вы обязательно разбогатеете! Притом не позже чем через 7-10 лет. " +
                "Начните правильно относиться к своим деньгам уже сегодня!");
        rich_principle.add("Лишь 20% усилий приводят к 80% результатов! 80% усилий, " +
                "соответственно, дают лишь 20% результатов.");
        rich_principle.add("Богатство — наше право данное нам от рождения. " +
                "Чтобы быть богатым совсем не обязательно родиться в богатой семье, " +
                "получить хорошее образование и т.п. " +
                "Достаточно правильно относится к своим деньгам и стремиться к совершенству.");
        rich_principle.add("Уверенность в себе и позитив — Важный принцип финансового успеха. " +
                "Заведите себе блокнот (журнал) успеха. Записывайте в него 5 вещей ежедневно, " +
                "которые Вы сделали хорошо.");
        rich_principle.add("Если столько не наберется у вас за день (5 заметок) " +
                "пишите, чем Вам просто понравился сегодняшний день. За что вы благодарите сегодняшний день.");
        rich_principle.add("Думайте о своем здоровье. Успех невозможен без хорошего здоровья. " +
                "Богатство без здоровья не принесет радость.");
        rich_principle.add("Вы должны всегда иметь запас финансовый прочности на 6 месяцев жизни минимум. " +
                "Вы можете потерять работу, доходы, трудоспособность и возможность где- либо взять деньги. " +
                "И даже многие успешные бизнесмены игнорируют часто эти правила.");
        rich_principle.add("Для хороших заработков нужны хорошие знания. " +
                "Старайтесь постоянно учиться, читать, расширять кругозор. Дуракам везет только в казино и то редко.");
        rich_principle.add("Капитализм — это «бассейн с крокодилами». Нельзя не учитывать то, " +
                "что Вы живете при капитализме! ...Выживает сильнейший. Будет богатым и " +
                "удержит деньги сильнейший.");
        rich_principle.add("Богатство — это не сколько Вы потратили в казино, ресторане, " +
                "на курорте или в магазине. Богатство это то, что Вы отложили и сберегли.");
        rich_principle.add("Вам не платят столько, сколько Вы стоите? " +
                "Нет, если Вы работаете за эти деньги — значит столько Вы стоите. " +
                "Если что-то не устраивает — меняйте работу, образ жизни, меняйте себя!");
        return rich_principle;
    }
    public ArrayList<String> _7_skills() {
        ArrayList<String> _7_skills = new ArrayList<>();
        _7_skills.add("Будьте проактивны. Проявляйте инициативу. " +
                "Берите ответственность за свою жизнь. Действуйте, а не будьте объектом воздействия " +
                "Не ждите, когда ситуация вынудит вас реагировать — это ограничит ваш выбор. " +
                "Принимайте на себя обязательства, и выполняйте их.");
        _7_skills.add("Начинайте, представляя конечную цель. Имейте видение того, " +
                "что хотите получить в итоге. Начиная дело, представляйте, " +
                "чего вы хотите добиться - результат и смысл.");
        _7_skills.add("Сначала делайте то, что необходимо делать сначала. " +
                "Расставляйте приоритеты. Сначала делайте самое главное, важное и (или) неотложное. " +
                "Второстепенное делегируйте другим людям или организациям. " +
                "Заменяйте в своих повседневных действиях «неотложное, срочное» на «важное и главное».");
        _7_skills.add("Думайте в духе «выиграл-выиграл». " +
                "Двигайтесь от зависимости от других к собственной независимости и далее — " +
                "к взаимозависимости с людьми и организациями. " +
                "Таким образом вы приобретете единомышленников.");
        _7_skills.add("Сначала стремитесь понять, а потом быть понятым. " +
                "Умейте слушать, находить логику в чужих аргументах и разделять чужие чувства. " +
                "Не ставьте поспешные «диагнозы» людям.");
        _7_skills.add("Достигайте синергии. Объединяйте людей ради позитивного " +
                "результата в различных областях деятельности - семья, бизнес, " +
                "рабочий коллектив, учеба. Суть синергии заключается в том, " +
                "чтобы ценить различия - уважать их, совершенствовать сильные стороны людей и " +
                "компенсировать собственные слабые.");
        _7_skills.add("Затачивайте «пилу». Повышайте свой профессионализм. " +
                "Развивайте самого себя. Обновляйте четыре измерения вашей натуры - физическое " +
                "(спорт, здоровое питание, полезное хобби), духовное " +
                "(медитации, прослушивание музыки, вдохновляющие фильмы и книги, вера), " +
                "интеллектуальное (постоянное повышение своего интеллектуального и " +
                "профессионального уровня) и социально-эмоциональное " +
                "(отношения с родными, близкими, друзьями).");
        return _7_skills;
    }
    public ArrayList<String> questions_introspection() {
        ArrayList<String> questions_introspection = new ArrayList<>();
        questions_introspection.add("Возьмите бумагу и ручку и честно ответьте себе на приведенные ниже вопросы.");
        questions_introspection.add("Что я думаю о деньгах?");
        questions_introspection.add("В чем, по моему мнению, заключается финансовое благополучие?");
        questions_introspection.add("Сколько мне нужно иметь, чтобы чувствовать себя успешным и счастливым?");
        questions_introspection.add("Как страхи у меня есть относительно богатства?");
        questions_introspection.add("Какие страхи у меня есть относительно безденежья?");
        questions_introspection.add("Почему у меня нет денег?");
        questions_introspection.add("Что я могу сделать, чтобы изменить ситуацию и начать зарабатывать?");
        return questions_introspection;
    }
    public ArrayList<String> practic_6_steps() {
        ArrayList<String> practic_6_steps = new ArrayList<>();

        practic_6_steps.add("Пересмотр своих установок;");
        practic_6_steps.add("Определение своей цели. Определение спецификации задачи, " +
                "т.е. прописывание четких цифр, расчет разных вариантов, определение времени, " +
                "сроков и составление финансового плана (создание капитала начинается с создания " +
                "финансового плана); ");
        practic_6_steps.add("Проработка ресурсной базы: время, деньги, здоровье, знания, навыки " +
                "(умение делать, а не просто знать), информация(какая есть, какой не хватает), люди;");
        practic_6_steps.add("Расчет своего баланса: определение доходов и расходов, активов и пассивов;");
        practic_6_steps.add("Выполнение поставленного плана;");
        practic_6_steps.add("Соблюдение принципов управления деньгами.");
        return practic_6_steps;
    }
    public ArrayList<String> _9_important_principles() {
        ArrayList<String> _9_important_principles = new ArrayList<>();
        _9_important_principles.add("Не просто делайте. Знайте свои пределы.");
        _9_important_principles.add("Не судите себя слишком строго. ");
        _9_important_principles.add("Проводите больше время с людьми старше 70 и моложе 6.");
        _9_important_principles.add("Попробуйте улыбаться по крайней мере трем людям в день.");
        _9_important_principles.add("Что другие люди думают о вас - не ваше дело.");
        _9_important_principles.add("Избавьтесь от всего, что не является для Вас полезным, красивым и радостным.");
        _9_important_principles.add("Хороша или плоха ситуация, она изменится.");
        _9_important_principles.add("Независимо от того, как вы себя чувствуете, вставайте, одевайтесь и идите.");
        _9_important_principles.add("Думайте позитивно и будьте счастливыми.");
        return _9_important_principles;
    }
    public ArrayList<String> _7_main_rules() {
        ArrayList<String> _7_main_rules = new ArrayList<>();

        _7_main_rules.add("Записывайте. Все деловые переговоры должны тщательно конспектироваться. " +
                "Если вы пришли на деловые переговоры без блокнота, можете приравнять свою оплошность " +
                "к профессиональному самоубийству.");
        _7_main_rules.add("Не одевайтесь вычурно. Не стоит одевать на себя всю модную одежду из шкафа. " +
                "Путь лучше это будут любимые, хоть и поношенью вещи.");
        _7_main_rules.add("Подарки - потом. Если у вас есть сувениры или подарки, " +
                "которые вы хотите вручить участникам встречи, сделайте это после переговоров, " +
                "а не до - иначе это будет выглядеть некрасиво.");
        _7_main_rules.add("Выключайте телефон. Или переводите его в беззвучный режим. " +
                "Если вы не топ-менеджер и не президент, то любой звонок вполне сможет подождать полчаса-час.");
        _7_main_rules.add("Контроль поведения. Следите за собой - отставить взгляды в пол, " +
                "игры ручкой, глупые рисунки на листочках бумаги. Не нужно чесаться, " +
                "откидываться на спинку кресла, ковырять в естественных отверстиях головы, " +
                "зевать и так далее. Сконцентрируйтесь - ваши собеседники это заметят. " +
                "А еще можете смело потренироваться на досуге.");
        _7_main_rules.add("Готовьтесь. Запишите тезисы на листочек бумаги и возьмите его с собой. " +
                "Прочитайте их несколько раз перед встречей — это поможет не забыть главного.");
        _7_main_rules.add("Пишите отчет. После встречи на электронные почты всех ее участников " +
                "должен упасть отчет-саммари всего, что обсуждалось во время встречи. " +
                "Это поможет быстро освежить в памяти все обсуждавшиеся вопросы.");
        return _7_main_rules;
    }

    public ArrayList<String> all_advise() {
        ArrayList<String> all_advise = new ArrayList<>();
        all_advise.clear();
        all_advise.addAll(_10_important());
        all_advise.addAll(habit_rich());
        all_advise.addAll(advice_Success());
        all_advise.addAll(advice_John());
        all_advise.addAll(_11_secrets());
        all_advise.addAll(way_earn());
        all_advise.addAll(_10_ways());
        all_advise.addAll(_10_ideas());
        all_advise.addAll(money_primets());
        all_advise.addAll(how_become_rich());
        all_advise.addAll(laws_success());
        all_advise.addAll(can_i_make());
        all_advise.addAll(how_create_ideas());
        all_advise.addAll(where_to_begin());
        all_advise.addAll(way_finances_manage());
        all_advise.addAll(rich_principle());
        all_advise.addAll(_7_skills());
        all_advise.addAll(questions_introspection());
        all_advise.addAll(practic_6_steps());
        all_advise.addAll(_9_important_principles());
        all_advise.addAll(_7_main_rules());
        return all_advise;
    }
}
